app/controllers/contents_controller.rb

  def index
    @contents = Content.all
---
SELECT "contents".* FROM "contents"

  def show
    @content = Content.find(params[:id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT 1  [["id", 5]]

  def create
    @content = Content.create(photo: params[:content][:photo])
---
INSERT INTO "contents" ("photo", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["photo", "DSCN0050.JPG"], ["created_at", "2015-05-14 02:06:53.047075"], ["updated_at", "2015-05-14 02:06:53.047075"]]